requests/request-get-claim.xml

<?xml version="1.0" encoding="utf-8"?>
<!-- WSDL: http://localhost:9080/insurance-health-component/ClaimsSoapService?wsdl -->
<!-- POST to: http://localhost:9080/insurance-health-component/ClaimsSoapService -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ns="http://soap.insurance.example.com/">
  <soapenv:Header/>
  <soapenv:Body>
    <ns:getClaim>
      <claimId>CLM-xxxx</claimId>
    </ns:getClaim>
  </soapenv:Body>
</soapenv:Envelope>
